# Select Data (Easy)

In [1]:
import pandas as pd

In [2]:
df = pd.read_excel('score.xlsx', index_col='지원번호')
df

       이름   학교    키   국어   영어   수학  과학  사회        SW특기
지원번호
1     채치수  북산고  197   90   85  100  95  85      Python
2     정대만  북산고  184   40   35   50  55  25        Java
3     송태섭  북산고  168   80   75   70  80  75  Javascript
4     서태웅  북산고  187   40   60   70  75  80         NaN
5     강백호  북산고  188   15   20   10  35  10         NaN
6     변덕규  능남고  202   80  100   95  85  80           C
7     황태산  능남고  188   55   65   45  40  35      PYTHON
8     윤대협  능남고  190  100   85   90  95  95          C#

## Select a Column (by column label)

In [3]:
df['이름']

지원번호
1    채치수
2    정대만
3    송태섭
4    서태웅
5    강백호
6    변덕규
7    황태산
8    윤대협
Name: 이름, dtype: object

## Select a Column (by column index)

In [4]:
df.columns

Index(['이름', '학교', '키', '국어', '영어', '수학', '과학', '사회', 'SW특기'], dtype='object')

In [5]:
df.columns[0]

'이름'

In [6]:
df[df.columns[0]]

지원번호
1    채치수
2    정대만
3    송태섭
4    서태웅
5    강백호
6    변덕규
7    황태산
8    윤대협
Name: 이름, dtype: object

In [7]:
df[df.columns[-1]] # grab the last column on the very right

지원번호
1        Python
2          Java
3    Javascript
4           NaN
5           NaN
6             C
7        PYTHON
8            C#
Name: SW특기, dtype: object

## Slicing Data

In [8]:
df

       이름   학교    키   국어   영어   수학  과학  사회        SW특기
지원번호
1     채치수  북산고  197   90   85  100  95  85      Python
2     정대만  북산고  184   40   35   50  55  25        Java
3     송태섭  북산고  168   80   75   70  80  75  Javascript
4     서태웅  북산고  187   40   60   70  75  80         NaN
5     강백호  북산고  188   15   20   10  35  10         NaN
6     변덕규  능남고  202   80  100   95  85  80           C
7     황태산  능남고  188   55   65   45  40  35      PYTHON
8     윤대협  능남고  190  100   85   90  95  95          C#

In [9]:
df['영어'][0:5] # grab 영어 data from 0 up to 5

지원번호
1    85
2    35
3    75
4    60
5    20
Name: 영어, dtype: int64

In [10]:
df[['이름', '키']][:3] # grab the first three names and height

       이름    키
지원번호
1     채치수  197
2     정대만  184
3     송태섭  168

In [11]:
df[3:]

       이름   학교    키   국어   영어  수학  과학  사회    SW특기
지원번호
4     서태웅  북산고  187   40   60  70  75  80     NaN
5     강백호  북산고  188   15   20  10  35  10     NaN
6     변덕규  능남고  202   80  100  95  85  80       C
7     황태산  능남고  188   55   65  45  40  35  PYTHON
8     윤대협  능남고  190  100   85  90  95  95      C#